;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! indium)
(package! reason-mode)
(package! prettier-js)
(package! move-text)
(package! vue-mode)
(package! origami)
(package! deadgrep)
(package! sql-indent)
(package! ascii-art-to-unicode)
(package! wakatime-mode)
(package! leetcode)

;; language
;;(package! dart-mode)
;;(package! kotlin-mode)

;; org-sutff
(package! org-fancy-priorities)

;; org-babel-extension
(package! ob-typescript)
(package! ob-dart)

;; writing
(package! org-noter)
(package! org-jira)
(package! ox-hugo)
(package! writeroom-mode)
(package! org-brain)
(package! org-bullets)

;; shell
(package! esh-autosuggest)
(package! fish-completion)

;; debugging
(package! dap-mode)

;; recording
(package! gif-screencast)

;; gtd
(package! org-super-agenda)
